tutorials/incompressible/simpleSolver/motorBike/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  SSGS;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        SSGS;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-09;
        relTol          0.001;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        USGS;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance        1e-08;
        relTol           0.01;
    }

    k
    {
        solver           PBiCGStab;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        USGS;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance        1e-08;
        relTol           0.01;
    }

    omega
    {
        solver           PBiCGStab;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        USGS;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance        1e-08;
        relTol           0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
